{"format": "layers-model", "generatedBy": "keras v3.13.2", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.13.2", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "beatbox_cnn", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer", "batchInputShape": [null, 64, 35, 1]}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [null, 64, 35, 1]}}, "training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 3.125000148429535e-05, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "beatbox_cnn/batch_normalization/gamma", "shape": [32], "dtype": "float32"}, {"name": "beatbox_cnn/batch_normalization/beta", "shape": [32], "dtype": "float32"}, {"name": "beatbox_cnn/batch_normalization/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "beatbox_cnn/batch_normalization/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "beatbox_cnn/batch_normalization_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "beatbox_cnn/batch_normalization_1/beta", "shape": [64], "dtype": "float32"}, {"name": "beatbox_cnn/batch_normalization_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "beatbox_cnn/batch_normalization_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "beatbox_cnn/conv2d/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "beatbox_cnn/conv2d/bias", "shape": [32], "dtype": "float32"}, {"name": "beatbox_cnn/conv2d_1/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "beatbox_cnn/conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "beatbox_cnn/dense/kernel", "shape": [64, 64], "dtype": "float32"}, {"name": "beatbox_cnn/dense/bias", "shape": [64], "dtype": "float32"}, {"name": "beatbox_cnn/dense_1/kernel", "shape": [64, 4], "dtype": "float32"}, {"name": "beatbox_cnn/dense_1/bias", "shape": [4], "dtype": "float32"}]}]}